app/controllers/api/btc_price_controller.rb

SELECT "btc_prices".* FROM "btc_prices" WHERE (date > 2018-02-06 22:46:23 -0300) ORDER BY "btc_prices"."date" ASC
---
        def last_five
            data = []
            max = []
            min = []
            #     { year: '2008', value: 5 },
            #     { year: '2009', value: 8 },
            #     { year: '2010', value: 12 },
            #     { year: '2011', value: 22 },
            #     { year: '2012', value: 18 }
            #   ]
            btcs = BtcPrice.order(:date)