app/controllers/dashboard_controller.rb

	def index
		@btc_prices = BtcPrice.where("date > ?", Time.now-1.day).order(:usd)
		@current_price = BtcPrice.order(:date).last
---
SELECT  "btc_prices".* FROM "btc_prices" WHERE (date > '2018-02-07 02:38:33.616580') ORDER BY "btc_prices"."usd" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "btc_prices".* FROM "btc_prices" ORDER BY "btc_prices"."date" DESC LIMIT $1  [["LIMIT", 1]]